public class Main {
    public static void main(String[] args) {
        /* Задание 1: Дана целочисленная матрица размера A(n,m), элементы которой
        могут принимать значения от 0 до 10. Коэффициентом похожести строк
        назовем количество чисел из пересечения множеств, составленных их этих
        строк. Отсортировать строки матрицы по степени похожести с k-ой строкой.
        Уточним, пусть есть две строки {1, 1, 3, 1, 27, 2, 3, 3}{1, 1, 3, 44, 1, 1, 21, 22}.
        Составим множества, составленные их этих строк. {1, 3, 27, 2}{1, 3, 44, 21, 22}.
        Совпадают числа 1 и 3. Коэффициент похожести строк равен двум.

        Задание 2: «Уплотнить» матрицу, удаляя из нее столбцы, заполненные четными
        числами.
        * */
        Tests.runAllTests();
    }
}

